Tekla.Structures.Model.Internal.OverlayModel.IOverlayModelEvents
Interface for the OverlayModelEvents class allows the user to register event listeners for OverlayModel events.

Tekla.Structures.Model.Internal.OverlayModel.IOverlayModelEvents.OverlayModelCollectionChanged
The OverlayModelCollectionChanged event is raised when an overlay model is changed (added/updated/removed).